DIRECTIONS = ['27.03.02', '27.03.01', '12.03.05', '12.03.01', '09.03.03',
              '01.03.02', '10.03.01', '09.03.01', '09.03.02', '13.03.02',
              '15.03.04', '11.03.04', '09.03.04', '11.03.03', '16.03.01',
              '27.03.05', '15.03.06', '23.03.01', '11.03.01', '27.03.04',
              '27.03.03', '11.03.02', '12.03.02', '25.03.01', '24.03.02',
              '12.03.04', '25.03.02', '45.03.02']
PROIRITIES = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

COUNTRIES = {
    'Российская Федерация': 'Российская Федерация ',
    'Беларусь': 'БЕЛАРУСЬ',
    'Казахстан': 'КАЗАХСТАН',
    'Украина': 'УКРАИНА',
    'Узбекистан': 'УЗБЕКИСТАН',
    'Армения': 'АРМЕНИЯ',
}

about_suai = '''🚀🎓 ГУАП – лидер отечественной высшей школы в использовании передовых образовательных технологий!

🌍 В России и за рубежом университет признан крупным научным центром и центром подготовки, переподготовки и повышения квалификации инженеров, программистов, экономистов, менеджеров, юристов широкого профиля.

💻 Занятия проходят на основе современной учебной базы в лабораториях с новейшим технологическим оборудованием.

🎓 87% преподавателей обладают учёными степенями.

📈 На 2024 год приходится 2553 студента, а в ГУАПе реализовано 106 программ по 3 возможным формам обучения.

🌟 Результаты в рейтингах подтверждают ведущую роль университета:
🚀 ГУАП в топ 40 рейтинга предпринимательских университетов России https://expert.ru
🌐 ГУАП в рейтинге лучших университетов России 2022 https://new.guap.ru/pubs/9403
🔝 ГУАП в рейтинге самых влиятельных вузов России https://raex-rr.com/education/universities_Influence_Russia/most_influential_universities/2022/
Присоединяйтесь к лучшим, выбирайте ГУАП – ваш путь к знаниям и успеху! 🌟📚'''

about_guap_army = '''🎖✨ Набор в Военный Учебный Центр ГУАП – это возможность для всех студентов 1, 2 курса очной формы обучения!

🇷🇺 Для тех, кто является гражданами Российской Федерации, состоит на воинском учёте в Санкт-Петербурге и прошел предварительный отбор в военкомате по направлению ВУЦ с категорией годности А или Б.

🎓 После успешного прохождения военных сборов и итоговой аттестации по военной подготовке, а также завершения обучения в университете, выпускнику присваивается звание лейтенанта или рядового запаса.

💪 Это уникальная возможность сочетать высшее образование с военной подготовкой и внести свой вклад в обеспечение обороноспособности страны. Присоединяйтесь к рядам будущих офицеров и солдат запаса в Военном Учебном Центре ГУАП! 🌟🛡'''

comission_info = '''🏰 Адрес: Санкт-Петербург, ул. Якубовича, д. 26

📞 Телефон: +7 (812) 312-21-07

📧 Электронная почта: priem@guap.ru

🕒 Режим работы:

ПН–ПТ — с 10:00 до 18:00
СБ–ВС — выходные дни

🚀 Не стесняйтесь связаться с нами, мы готовы помочь вам на каждом этапе вашего образовательного пути в ГУАП! 🌟📚'''

about_study_process = '''🚀📚 Модель образовательного процесса в ГУАП строится на комплексном применении основных технологий Индустрии 4.0, в тесном взаимодействии с технологическими и индустриальными партнерами. Это позволяет нам реализовать практико-ориентированную подготовку студентов на основе реальных задач бизнеса.

🌐 Мы формируем открытую среду, поддерживаем постоянный диалог между образованием, наукой и бизнесом, способствуем взаимодействию студентов, преподавателей и работодателей. Результат этой деятельности — актуальные научные, образовательные, исследовательские и предпринимательские проекты.

🎓 В нашем вузе вы не просто получите высшее образование, но и станете частью насыщенной студенческой жизни. У нас ждут яркие культурные и спортивные события, атмосфера дружбы и поддержки.

🤝 Для всего коллектива ГУАП важно, чтобы студенты получали знания в комфортной и дружелюбной атмосфере. Присоединяйтесь к нам, где образование – это не только процесс, но и увлекательное путешествие! 🚀🌟'''

previous_points = '''📊 Баллы прошлых лет https://priem.guap.ru/bach/archive'''


welcome_text = '''Привет, будущие студенты ГУАПа! 🚀🎓

Добро пожаловать в мир знаний и возможностей! Мы - ваш надежный проводник в увлекательном путешествии к успеху. 🌟📚

В нашем Telegram-боте собрана вся необходимая информация для абитуриентов ГУАПа. Здесь вы найдете ответы на ваши вопросы, полезные советы и поддержку на каждом этапе поступления.

Но это еще не все! Мы предоставляем уникальную возможность узнать вероятность вашего поступления на выбранную специальность. Давайте вместе создадим ваш путь к профессиональному успеху!

Не откладывайте свое будущее на потом. Присоединяйтесь к нам, и вместе мы сделаем шаг в мир знаний и достижений! 🚀🔍

Удачи на экзаменах, и помните, что мы здесь, чтобы поддержать вас на каждом шагу! 🌟📚'''


hw_it_works_about = '''Как это работает? Очень просто:

📝 Ввод данных:
Введите информацию о себе, такую как название выбранной специальности, приоритет, итоговый балл, дополнительные баллы, средний балл за ЕГЭ, гражданство и факт сдачи вступительных экзаменов.

🤖 Магия Машинного Обучения:
Наш бот запускает мощную модель машинного обучения, которая анализирует ваши данные. Она учитывает все важные факторы и создает прогноз вероятности вашего поступления.

🎉 Результат:
Получите индивидуальный отчет о вероятности поступления на выбранную специальность. Будьте уверены, что каждая цифра исходит из ваших данных и позволяет вам лучше понять свои шансы.

🤝 Поддержка и Советы:
Мы не просто предоставляем результаты, мы также готовы помочь вам с пониманием данных, давать рекомендации и ответы на ваши вопросы. Наши двери всегда открыты для вас!


Не беспокойтесь, если это звучит сложно – наш бот разработан с учетом вашего удобства. Просто следуйте инструкциям, и мы вместе создадим карту вашего успешного поступления! 🚀🔮'''

